app/controllers/pictures_controller.rb

  def index
    @pictures = Picture.all
---
SELECT "pictures".* FROM "pictures"

  def create
    @picture = Picture.new(picture_params)

    respond_to do |format|
      if @picture.save
---
INSERT INTO "pictures" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", 2016-07-17 20:49:25 UTC], ["updated_at", 2016-07-17 20:49:25 UTC]]

  def destroy
    @picture.destroy
---
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 2]]

    def set_picture
      @picture = Picture.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]